In [2]:
import pandas as pd

In [3]:
 # create a series
Male_Ages = pd.Series(["12","13","14","15"])
Male_Ages

0    12
1    13
2    14
3    15
dtype: object

In [4]:
# create a series called Female_Ages
Female_Ages = pd.Series(["21", "22", "23", "24"])
Female_Ages

0    21
1    22
2    23
3    24
dtype: object

In [5]:
# Merge the two series you created to create a DataFrame
combined_ages = pd.DataFrame({"Male Ages": Male_Ages, "Female Ages": Female_Ages})
combined_ages

  Male Ages Female Ages
0        12          21
1        13          22
2        14          23
3        15          24

In [6]:
# convert the dataframe to a csv file
combined_ages.to_csv("Exported-combined-ages.csv")
combined_ages

  Male Ages Female Ages
0        12          21
1        13          22
2        14          23
3        15          24

In [7]:
# create a series
Yam_Prices = pd.Series(["40", "50", "60", "60"])
Yam_Prices

0    40
1    50
2    60
3    60
dtype: object

In [8]:
Beans_Prices = pd.Series(["200", "300", "400", "500"])
Beans_Prices

0    200
1    300
2    400
3    500
dtype: object

In [9]:
Banana_Prices = pd.Series(["10", "20", "30", "40"])
Banana_Prices

0    10
1    20
2    30
3    40
dtype: object

In [10]:
Orange_Prices = pd.Series(["5", "6", "7", "8"])
Orange_Prices

0    5
1    6
2    7
3    8
dtype: object

In [11]:
# merge the series created to create a data frame
Combined_Prices = pd.DataFrame({"Yam Prices":Yam_Prices, "Beans Prices":Beans_Prices, "Banana Prices":Banana_Prices, "Orange Prices":Orange_Prices
 })
Combined_Prices

  Yam Prices Beans Prices Banana Prices Orange Prices
0         40          200            10             5
1         50          300            20             6
2         60          400            30             7
3         60          500            40             8

In [12]:
# Convert the data frame to csv
Combined_Prices.to_csv("Exported-Combined-Prices.csv")
Combined_Prices

  Yam Prices Beans Prices Banana Prices Orange Prices
0         40          200            10             5
1         50          300            20             6
2         60          400            30             7
3         60          500            40             8

In [13]:
# import data
heart_disease = pd.read_csv("heart-disease.csv")
heart_disease

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0